Revit 2024 API
CameraInfo.FarDistance Property
 Distance from eye point to far plane of view frustum along the view direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double FarDistance { get; }
Visual Basic
Public ReadOnly Property FarDistance As Double
	Get
Visual C++
public:
property double FarDistance {
	double get ();
}
Remarks
 This property together with NearDistance determines the depth restrictions of a view frustum.
See Also
CameraInfo Class
Autodesk.Revit.DB Namespace